app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @books = Book.all
    @book = Book.new
    @user = current_user.id
        @userid = current_user.id
        @image = User.find(@userid)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])

        @userid = current_user.id
        @user = User.find(@userid)
        @image = User.find(@userid)

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "q"], ["body", "っっq"], ["created_at", "2021-10-24 10:20:09.734476"], ["updated_at", "2021-10-24 10:20:09.734476"], ["user_id", 9]]
---
  def create
    @book = Book.new(book_params)
    @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "q更新"], ["updated_at", "2021-10-24 10:20:37.790866"], ["id", 6]]
---
  def update
    @books = Book.all
    @book = Book.find(params[:id])
    @book.update(book_params)