app/controllers/users_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @users = User.all
    @user = current_user
    #@user = User.find(params[:id])
    @books = Book.where(user_id:@user.id)
        @userid = current_user.id
        @image = User.find(@userid)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "6b468f7de9d0132a1f185b3d6d0feea64fff6f43f86b95ebb065c01f5846"], ["introduction", ""], ["updated_at", "2021-10-23 09:39:12.849622"], ["id", 6]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
   #@users = User.all
    @users = User.all