app/controllers/users_controller.rb

SELECT "books".* FROM "books"
---
  def show
    @books = Book.all